{
  "About": {
    "p1": "Ben Abdullah. Almanya’da doğdum, Türkiye’de büyüdüm. Bir dönem İslami ilimlerle ilgilendim; bugün odağım yazılım.",
    "p2": "Özellikle Full-Stack geliştirme alanında ilerliyorum ve tamamen JavaScript ekosistemine geçiş sürecindeyim. React, Next.js, TypeScript ve Node.js ile üretim yapıyorum. Temiz kod, sürdürülebilir yapı ve anlaşılabilir mimari her projede titizlikle önemsediğim konular.",
    "p3": "Yazılım benim için bir meslek değil; hayal ettiklerimi gerçeğe dönüştürme biçimi. Öğrenmek, üretmek ve iz bırakmak için kod yazıyorum.",
    "p4": "Sürekli gelişim benim için hedef değil, alışkanlık. Bir gün API mimarisini sadeleştirirken, ertesi gün yeni bir UI framework’ünü denerim. Disiplinli ama esnek, meraklı ama seçici biriyim. Tek başıma üretmeyi de, iyi bir ekiple aynı vizyonda çalışmayı da severim.",
    "p5": "Amacım sadece iyi bir yazılımcı olmak değil; değer katan, kalıcı işler üreten bir insan olmak.",
    "title": "Ben Kimim?"
  },
  "Metadata": {
    "title": "Abdullah V. ÇOŞKUN | Full Stack Web Developer",
    "name": "Abdullah V. ÇOŞKUN",
    "description": "Full Stack Web Developer. React, Next.js, TypeScript, Node.js ile modern web uygulamaları geliştiriyorum. Temiz kod, sürdürülebilir yapı ve kullanıcı odaklı çözümler."
  },
  "SidebarNav": {
    "About": "Hakkımda",
    "Experiences": "Deneyimler",
    "Projects": "Projeler",
    "Skills": "Yetenekler"
  },
  "Projects": {
    "title": "Projeler",
    "noProjects": "Şu an çekilecek proje bulunamadı. Token yoksa .env ekle, uygulamayı yeniden başlat.",
    "noImage": "Görsel yok",
    "github": "GitHub",
    "liveDemo": "Canlı demo"
  },
  "Skills": {
    "title": "Yetenekler",
    "subtitle": "Çalıştığım teknolojiler ve araçlar",
    "frontend": "Frontend",
    "backend": "Backend",
    "ai": "YZ & Otomasyon",
    "tools": "Araçlar",
    "languages": "Diller",
    "turkish": "Türkçe",
    "german": "Almanca",
    "english": "İngilizce"
  },
  "experience": {
    "title": "Deneyimler",
    "items": {
      "fullstack": {
        "title": "Full Stack Web Developer",
        "company": "Freelancer",
        "description": "React, Node.js ve TypeScript kullanarak uçtan uca web projeleri geliştirdim. Performanslı, yeniden kullanılabilir ve sürdürülebilir yapılar kurmaya odaklandım. Modern UI/UX prensipleriyle kullanıcı odaklı, hızlı ve esnek arayüzler tasarladım."
      },
      "frontend": {
        "title": "Frontend Developer",
        "company": "Patika+ Bootcamp",
        "description": "Vite altyapısıyla React projeleri geliştirdim. Material UI ve Tailwind CSS ile responsive, modern UI'lar oluşturdum. Git ve GitHub ile versiyon kontrol süreçlerini etkin şekilde yönettim."
      },
      "backend": {
        "title": "Backend Developer",
        "company": "Patika+ Bootcamp",
        "description": ".NET Core ile RESTful API'ler geliştirdim. Entity Framework Core ile Code First yaklaşımı kullanarak veritabanı yönetimi gerçekleştirdim. JWT, middleware, servis mimarisi gibi gelişmiş backend yapıları uyguladım."
      },
      "teacher": {
        "title": "Eğitimci & Arapça Hocası",
        "company": "Medrese",
        "description": "11 yıl boyunca sarf, nahiv ve fıkıh gibi klasik İslami ilimlerde hem eğitim aldım hem de müderrislik yaptım. Son 2 yıl boyunca 4-6 yaş grubu çocuklara sıbyan eğitimi verdim. Bu süreçte pedagojik yetkinlik, sabır, iletişim ve güçlü anlatım becerileri kazandım."
      }
    }
  }
}
